/* Задача 34: Задайте массив заполненный случайными положительными трёхзначными числами. 
Напишите программу, которая покажет количество чётных чисел в массиве.
[345, 897, 568, 234] -> 2
*/
////////////////////////////////////////////////////////////////////////////////////////////////////////

Console.Clear();
int[] array = new int[8];
FillArray(array);

int countEven = CountEvenNumbers(array);

Console.WriteLine($"[{String.Join(" ", array)}] -> {countEven}");

/////////////////////////////////////////////////////////////////////////////////////////////////////

void FillArray(int[] arr)
{
    for (int i = 0; i < arr.Length; i++)
    {
        arr[i] = new Random().Next(100, 1000);
    }
}

int CountEvenNumbers(int[] arr)
{
    int count = 0;
    for (int i = 0; i < arr.Length; i++)
    {
        if (arr[i] % 2 == 0)
            count += 1;
    }
    return count;
}